// 'https://jsonplaceholder.typicode.com/users/'

// async, await

// function getUsers() {
//     fetch('https://jsonplaceholder.typicode.com/users/')
//         .then((res) => res.json())
//         .then((data) => console.log(data))
// }
//
// getUsers()


// const getUsers = async () =>{
//     const url = await fetch('https://jsonplaceholder.typicode.com/users/')
//     const data = await url.json()
//     console.log(data)
// }
//
// getUsers()

// const getUsers = async () => {
//     const res = await axios('https://jsonplaceholder.typicode.com/users/')
//     const {data} = await res
//     console.log(data)
// }
// getUsers()


// const getUsers = async () => {
//     try {
//         const res = await axios('https://jsonplaceholder.typicode.com/users/')
//         const {data} = await res
//         console.log(data)
//     } catch (error) {
//         console.log('Error...', error)
//     }
// }
// getUsers()


// initialization
// condition
// step


// 10. Вам дан массив с числами [5, 1, 3, 7, 6, 15, 3, 20]. С помощью цикла for и оператора if проверьте есть ли в
// массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.
// 11. Вам дан массив числами [10, 20, 30, 40, 135, 2000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.

// 12. Вам дан массив с элементами [1, 2, 3, 4, 5, 6, 7, 8, 9]. С помощью цикла
// for создайте строку '-1-2-3-4-5-6-7-8-9-'.

// 13. Вам дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.

// 14. Вам дан массив с числами [1, 2, 3, 7, 6, 9]. Найдите среднее арифметическое
// его элементов (сумма элементов, делить на количество).

// 15. Вам дан массив с числами [1, 2, 3, 4, 5]. С помощью цикла найдите сумму квадратов элементов этого массива.
// 16. Вам дан массив с числами [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12]. С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.
// 17. Создайте переменную с пустым массивом, заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла.
// 18. Создайте цикл, который суммирует числа, кратные 3 и 5 до 1000.
// 19. Вам дан массив [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21].Создайте цикл, который выводит нечетные числа, которые больше 10.
// 20. Вам дана строка 'jzvzszrzpz'. Измените каждую вторую букву на верхний регистр.















